MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F451FEUB/mcu.h
    /* WDT */
    EVT_SRC_WDT_REFUDF          = 439U,     /* WDT_REFUDF */

    /* ADC */
    EVT_SRC_ADC1_EOCA           = 448U,     /* ADC1_EOCA   */
    EVT_SRC_ADC1_EOCB           = 449U,     /* ADC1_EOCB   */
    EVT_SRC_ADC1_CHCMP          = 450U,     /* ADC1_CHCMP  */
    EVT_SRC_ADC1_SEQCMP         = 451U,     /* ADC1_SEQCMP */
    EVT_SRC_ADC2_EOCA           = 452U,     /* ADC2_EOCA   */
    EVT_SRC_ADC2_EOCB           = 453U,     /* ADC2_EOCB   */
    EVT_SRC_ADC2_CHCMP          = 454U,     /* ADC2_CHCMP  */
    EVT_SRC_ADC2_SEQCMP         = 455U,     /* ADC2_SEQCMP */

    /* TRNG */
    EVT_SRC_TRNG_END            = 456U,     /* TRNG_END */

    /* SDIO */
    EVT_SRC_SDIOC1_DMAR         = 480U,     /* SDIOC1_DMAR */
    EVT_SRC_SDIOC1_DMAW         = 481U,     /* SDIOC1_DMAW */
    EVT_SRC_SDIOC2_DMAR         = 483U,     /* SDIOC2_DMAR */
    EVT_SRC_SDIOC2_DMAW         = 484U,     /* SDIOC2_DMAW */
    EVT_SRC_MAX                 = 511U,
} en_event_src_t;

/**
 *******************************************************************************
 ** \brief Interrupt number enumeration
 ******************************************************************************/
typedef enum {
    INT_SRC_SWI_IRQ0            = 0U,       /* SWI_IRQ0  */
    INT_SRC_SWI_IRQ1            = 1U,       /* SWI_IRQ1  */
    INT_SRC_SWI_IRQ2            = 2U,       /* SWI_IRQ2  */
    INT_SRC_SWI_IRQ3            = 3U,       /* SWI_IRQ3  */
    INT_SRC_SWI_IRQ4            = 4U,       /* SWI_IRQ4  */
    INT_SRC_SWI_IRQ5            = 5U,       /* SWI_IRQ5  */
    INT_SRC_SWI_IRQ6            = 6U,       /* SWI_IRQ6  */
    INT_SRC_SWI_IRQ7            = 7U,       /* SWI_IRQ7  */
    INT_SRC_SWI_IRQ8            = 8U,       /* SWI_IRQ8  */
    INT_SRC_SWI_IRQ9            = 9U,       /* SWI_IRQ9  */
    INT_SRC_SWI_IRQ10           = 10U,      /* SWI_IRQ10 */
    INT_SRC_SWI_IRQ11           = 11U,      /* SWI_IRQ11 */
    INT_SRC_SWI_IRQ12           = 12U,      /* SWI_IRQ12 */
    INT_SRC_SWI_IRQ13           = 13U,      /* SWI_IRQ13 */
    INT_SRC_SWI_IRQ14           = 14U,      /* SWI_IRQ14 */
    INT_SRC_SWI_IRQ15           = 15U,      /* SWI_IRQ15 */
    INT_SRC_SWI_IRQ16           = 16U,      /* SWI_IRQ16 */
    INT_SRC_SWI_IRQ17           = 17U,      /* SWI_IRQ17 */
    INT_SRC_SWI_IRQ18           = 18U,      /* SWI_IRQ18 */
    INT_SRC_SWI_IRQ19           = 19U,      /* SWI_IRQ19 */
    INT_SRC_SWI_IRQ20           = 20U,      /* SWI_IRQ20 */
    INT_SRC_SWI_IRQ21           = 21U,      /* SWI_IRQ21 */
    INT_SRC_SWI_IRQ22           = 22U,      /* SWI_IRQ22 */
    INT_SRC_SWI_IRQ23           = 23U,      /* SWI_IRQ23 */
    INT_SRC_SWI_IRQ24           = 24U,      /* SWI_IRQ24 */
    INT_SRC_SWI_IRQ25           = 25U,      /* SWI_IRQ25 */
    INT_SRC_SWI_IRQ26           = 26U,      /* SWI_IRQ26 */
    INT_SRC_SWI_IRQ27           = 27U,      /* SWI_IRQ27 */
    INT_SRC_SWI_IRQ28           = 28U,      /* SWI_IRQ28 */
    INT_SRC_SWI_IRQ29           = 29U,      /* SWI_IRQ29 */
    INT_SRC_SWI_IRQ30           = 30U,      /* SWI_IRQ30 */
    INT_SRC_SWI_IRQ31           = 31U,      /* SWI_IRQ31 */

    /* External Interrupt. */
    INT_SRC_PORT_EIRQ0          = 0U,       /* PORT_EIRQ0  */
    INT_SRC_PORT_EIRQ1          = 1U,       /* PORT_EIRQ1  */
    INT_SRC_PORT_EIRQ2          = 2U,       /* PORT_EIRQ2  */
    INT_SRC_PORT_EIRQ3          = 3U,       /* PORT_EIRQ3  */
    INT_SRC_PORT_EIRQ4          = 4U,       /* PORT_EIRQ4  */
    INT_SRC_PORT_EIRQ5          = 5U,       /* PORT_EIRQ5  */
    INT_SRC_PORT_EIRQ6          = 6U,       /* PORT_EIRQ6  */
    INT_SRC_PORT_EIRQ7          = 7U,       /* PORT_EIRQ7  */
    INT_SRC_PORT_EIRQ8          = 8U,       /* PORT_EIRQ8  */
    INT_SRC_PORT_EIRQ9          = 9U,       /* PORT_EIRQ9  */
    INT_SRC_PORT_EIRQ10         = 10U,      /* PORT_EIRQ10 */
    INT_SRC_PORT_EIRQ11         = 11U,      /* PORT_EIRQ11 */
    INT_SRC_PORT_EIRQ12         = 12U,      /* PORT_EIRQ12 */
    INT_SRC_PORT_EIRQ13         = 13U,      /* PORT_EIRQ13 */
    INT_SRC_PORT_EIRQ14         = 14U,      /* PORT_EIRQ14 */
    INT_SRC_PORT_EIRQ15         = 15U,      /* PORT_EIRQ15 */

    /* DMAC */
    INT_SRC_DMA1_TC0            = 32U,      /* DMA1_TC0  */
    INT_SRC_DMA1_TC1            = 33U,      /* DMA1_TC1  */
    INT_SRC_DMA1_TC2            = 34U,      /* DMA1_TC2  */
    INT_SRC_DMA1_TC3            = 35U,      /* DMA1_TC3  */
    INT_SRC_DMA2_TC0            = 36U,      /* DMA2_TC0  */
    INT_SRC_DMA2_TC1            = 37U,      /* DMA2_TC1  */
    INT_SRC_DMA2_TC2            = 38U,      /* DMA2_TC2  */
    INT_SRC_DMA2_TC3            = 39U,      /* DMA2_TC3  */
    INT_SRC_DMA1_BTC0           = 40U,      /* DMA1_BTC0 */
    INT_SRC_DMA1_BTC1           = 41U,      /* DMA1_BTC1 */
    INT_SRC_DMA1_BTC2           = 42U,      /* DMA1_BTC2 */
    INT_SRC_DMA1_BTC3           = 43U,      /* DMA1_BTC3 */
    INT_SRC_DMA2_BTC0           = 44U,      /* DMA2_BTC0 */
    INT_SRC_DMA2_BTC1           = 45U,      /* DMA2_BTC1 */
    INT_SRC_DMA2_BTC2           = 46U,      /* DMA2_BTC2 */
    INT_SRC_DMA2_BTC3           = 47U,      /* DMA2_BTC3 */
    INT_SRC_DMA1_ERR            = 48U,      /* DMA1_ERR */
    INT_SRC_DMA2_ERR            = 49U,      /* DMA2_ERR */

    /* EFM */
    INT_SRC_EFM_PEERR           = 50U,      /* EFM_PEERR */
    INT_SRC_EFM_COLERR          = 51U,      /* EFM_COLERR */
    INT_SRC_EFM_OPTEND          = 52U,      /* EFM_OPTEND */

    /* QSPI */
    INT_SRC_QSPI_INTR           = 54U,      /* QSPI_INTR */

    /* DCU */
    INT_SRC_DCU1                = 55U,      /* DCU1 */
    INT_SRC_DCU2                = 56U,      /* DCU2 */
    INT_SRC_DCU3                = 57U,      /* DCU3 */
    INT_SRC_DCU4                = 58U,      /* DCU4 */

    /* TIMER 0 */
    INT_SRC_TMR0_1_CMP_A        = 64U,      /* TMR01_GCMA */
    INT_SRC_TMR0_1_CMP_B        = 65U,      /* TMR01_GCMB */
    INT_SRC_TMR0_2_CMP_A        = 66U,      /* TMR02_GCMA */
    INT_SRC_TMR0_2_CMP_B        = 67U,      /* TMR02_GCMB */

    /* RTC */
    INT_SRC_RTC_ALM             = 81U,      /* RTC_ALM */
    INT_SRC_RTC_PRD             = 82U,      /* RTC_PRD */

    /* XTAL32 stop */
    INT_SRC_XTAL32_STOP         = 84U,      /* XTAL32_STOP */

    /* XTAL stop */
    INT_SRC_XTAL_STOP           = 85U,      /* XTAL_STOP */

    /* wake-up timer */
    INT_SRC_WKTM_PRD            = 86U,      /* WKTM_PRD */

