MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F451FEUB/mcu.h
/*  Bit definition for GPIO_POTRA register  */
#define GPIO_POTRA_POT00_POS                           (0U)
#define GPIO_POTRA_POT00                               (0x0001U)
#define GPIO_POTRA_POT04_POS                           (4U)
#define GPIO_POTRA_POT04                               (0x0010U)
#define GPIO_POTRA_POT08_POS                           (8U)
#define GPIO_POTRA_POT08                               (0x0100U)
#define GPIO_POTRA_POT11_POS                           (11U)
#define GPIO_POTRA_POT11                               (0x0800U)
#define GPIO_POTRA_POT12_POS                           (12U)
#define GPIO_POTRA_POT12                               (0x1000U)
#define GPIO_POTRA_POT13_POS                           (13U)
#define GPIO_POTRA_POT13                               (0x2000U)
#define GPIO_POTRA_POT14_POS                           (14U)
#define GPIO_POTRA_POT14                               (0x4000U)
#define GPIO_POTRA_POT15_POS                           (15U)
#define GPIO_POTRA_POT15                               (0x8000U)

/*  Bit definition for GPIO_PIDRB register  */
#define GPIO_PIDRB_PIN01_POS                           (1U)
#define GPIO_PIDRB_PIN01                               (0x0002U)
#define GPIO_PIDRB_PIN02_POS                           (2U)
#define GPIO_PIDRB_PIN02                               (0x0004U)
#define GPIO_PIDRB_PIN03_POS                           (3U)
#define GPIO_PIDRB_PIN03                               (0x0008U)
#define GPIO_PIDRB_PIN04_POS                           (4U)
#define GPIO_PIDRB_PIN04                               (0x0010U)
#define GPIO_PIDRB_PIN05_POS                           (5U)
#define GPIO_PIDRB_PIN05                               (0x0020U)
#define GPIO_PIDRB_PIN10_POS                           (10U)
#define GPIO_PIDRB_PIN10                               (0x0400U)
#define GPIO_PIDRB_PIN11_POS                           (11U)
#define GPIO_PIDRB_PIN11                               (0x0800U)
#define GPIO_PIDRB_PIN12_POS                           (12U)
#define GPIO_PIDRB_PIN12                               (0x1000U)
#define GPIO_PIDRB_PIN13_POS                           (13U)
#define GPIO_PIDRB_PIN13                               (0x2000U)
#define GPIO_PIDRB_PIN14_POS                           (14U)
#define GPIO_PIDRB_PIN14                               (0x4000U)
#define GPIO_PIDRB_PIN15_POS                           (15U)
#define GPIO_PIDRB_PIN15                               (0x8000U)

/*  Bit definition for GPIO_PODRB register  */
#define GPIO_PODRB_POUT01_POS                          (1U)
#define GPIO_PODRB_POUT01                              (0x0002U)
#define GPIO_PODRB_POUT02_POS                          (2U)
#define GPIO_PODRB_POUT02                              (0x0004U)
#define GPIO_PODRB_POUT03_POS                          (3U)
#define GPIO_PODRB_POUT03                              (0x0008U)
#define GPIO_PODRB_POUT04_POS                          (4U)
#define GPIO_PODRB_POUT04                              (0x0010U)
#define GPIO_PODRB_POUT05_POS                          (5U)
#define GPIO_PODRB_POUT05                              (0x0020U)
#define GPIO_PODRB_POUT10_POS                          (10U)
#define GPIO_PODRB_POUT10                              (0x0400U)
#define GPIO_PODRB_POUT11_POS                          (11U)
#define GPIO_PODRB_POUT11                              (0x0800U)
#define GPIO_PODRB_POUT12_POS                          (12U)
#define GPIO_PODRB_POUT12                              (0x1000U)
#define GPIO_PODRB_POUT13_POS                          (13U)
#define GPIO_PODRB_POUT13                              (0x2000U)
#define GPIO_PODRB_POUT14_POS                          (14U)
#define GPIO_PODRB_POUT14                              (0x4000U)
#define GPIO_PODRB_POUT15_POS                          (15U)
#define GPIO_PODRB_POUT15                              (0x8000U)

/*  Bit definition for GPIO_POERB register  */
#define GPIO_POERB_POUTE01_POS                         (1U)
#define GPIO_POERB_POUTE01                             (0x0002U)
#define GPIO_POERB_POUTE02_POS                         (2U)
#define GPIO_POERB_POUTE02                             (0x0004U)
#define GPIO_POERB_POUTE03_POS                         (3U)
#define GPIO_POERB_POUTE03                             (0x0008U)
#define GPIO_POERB_POUTE04_POS                         (4U)
#define GPIO_POERB_POUTE04                             (0x0010U)
#define GPIO_POERB_POUTE05_POS                         (5U)
#define GPIO_POERB_POUTE05                             (0x0020U)
#define GPIO_POERB_POUTE10_POS                         (10U)
#define GPIO_POERB_POUTE10                             (0x0400U)
#define GPIO_POERB_POUTE11_POS                         (11U)
#define GPIO_POERB_POUTE11                             (0x0800U)
#define GPIO_POERB_POUTE12_POS                         (12U)
#define GPIO_POERB_POUTE12                             (0x1000U)
#define GPIO_POERB_POUTE13_POS                         (13U)
#define GPIO_POERB_POUTE13                             (0x2000U)
#define GPIO_POERB_POUTE14_POS                         (14U)
#define GPIO_POERB_POUTE14                             (0x4000U)
#define GPIO_POERB_POUTE15_POS                         (15U)
#define GPIO_POERB_POUTE15                             (0x8000U)

/*  Bit definition for GPIO_POSRB register  */
#define GPIO_POSRB_POS01_POS                           (1U)
#define GPIO_POSRB_POS01                               (0x0002U)
#define GPIO_POSRB_POS02_POS                           (2U)
#define GPIO_POSRB_POS02                               (0x0004U)
#define GPIO_POSRB_POS03_POS                           (3U)
#define GPIO_POSRB_POS03                               (0x0008U)
#define GPIO_POSRB_POS04_POS                           (4U)
#define GPIO_POSRB_POS04                               (0x0010U)
#define GPIO_POSRB_POS05_POS                           (5U)
#define GPIO_POSRB_POS05                               (0x0020U)
#define GPIO_POSRB_POS10_POS                           (10U)
#define GPIO_POSRB_POS10                               (0x0400U)
#define GPIO_POSRB_POS11_POS                           (11U)
#define GPIO_POSRB_POS11                               (0x0800U)
#define GPIO_POSRB_POS12_POS                           (12U)
#define GPIO_POSRB_POS12                               (0x1000U)
#define GPIO_POSRB_POS13_POS                           (13U)
#define GPIO_POSRB_POS13                               (0x2000U)
#define GPIO_POSRB_POS14_POS                           (14U)
#define GPIO_POSRB_POS14                               (0x4000U)
#define GPIO_POSRB_POS15_POS                           (15U)
#define GPIO_POSRB_POS15                               (0x8000U)

/*  Bit definition for GPIO_PORRB register  */
#define GPIO_PORRB_POR01_POS                           (1U)
#define GPIO_PORRB_POR01                               (0x0002U)
#define GPIO_PORRB_POR02_POS                           (2U)
#define GPIO_PORRB_POR02                               (0x0004U)
#define GPIO_PORRB_POR03_POS                           (3U)
#define GPIO_PORRB_POR03                               (0x0008U)
#define GPIO_PORRB_POR04_POS                           (4U)
#define GPIO_PORRB_POR04                               (0x0010U)
#define GPIO_PORRB_POR05_POS                           (5U)
#define GPIO_PORRB_POR05                               (0x0020U)
#define GPIO_PORRB_POR10_POS                           (10U)
#define GPIO_PORRB_POR10                               (0x0400U)
#define GPIO_PORRB_POR11_POS                           (11U)
#define GPIO_PORRB_POR11                               (0x0800U)
#define GPIO_PORRB_POR12_POS                           (12U)
#define GPIO_PORRB_POR12                               (0x1000U)
#define GPIO_PORRB_POR13_POS                           (13U)
#define GPIO_PORRB_POR13                               (0x2000U)
#define GPIO_PORRB_POR14_POS                           (14U)
#define GPIO_PORRB_POR14                               (0x4000U)
#define GPIO_PORRB_POR15_POS                           (15U)
#define GPIO_PORRB_POR15                               (0x8000U)

/*  Bit definition for GPIO_POTRB register  */
#define GPIO_POTRB_POT01_POS                           (1U)
#define GPIO_POTRB_POT01                               (0x0002U)
#define GPIO_POTRB_POT02_POS                           (2U)
#define GPIO_POTRB_POT02                               (0x0004U)
#define GPIO_POTRB_POT03_POS                           (3U)
#define GPIO_POTRB_POT03                               (0x0008U)
#define GPIO_POTRB_POT04_POS                           (4U)
#define GPIO_POTRB_POT04                               (0x0010U)
#define GPIO_POTRB_POT05_POS                           (5U)
#define GPIO_POTRB_POT05                               (0x0020U)
#define GPIO_POTRB_POT10_POS                           (10U)
#define GPIO_POTRB_POT10                               (0x0400U)
#define GPIO_POTRB_POT11_POS                           (11U)
#define GPIO_POTRB_POT11                               (0x0800U)
#define GPIO_POTRB_POT12_POS                           (12U)
#define GPIO_POTRB_POT12                               (0x1000U)
#define GPIO_POTRB_POT13_POS                           (13U)
#define GPIO_POTRB_POT13                               (0x2000U)
#define GPIO_POTRB_POT14_POS                           (14U)
#define GPIO_POTRB_POT14                               (0x4000U)
#define GPIO_POTRB_POT15_POS                           (15U)
#define GPIO_POTRB_POT15                               (0x8000U)

/*  Bit definition for GPIO_PIDRC register  */
#define GPIO_PIDRC_PIN13_POS                           (13U)
#define GPIO_PIDRC_PIN13                               (0x2000U)
#define GPIO_PIDRC_POUT13_POS                          (13U)
#define GPIO_PIDRC_POUT13                              (0x2000U)
#define GPIO_PIDRC_PIN14_POS                           (14U)
#define GPIO_PIDRC_PIN14                               (0x4000U)
#define GPIO_PIDRC_POUT14_POS                          (14U)
#define GPIO_PIDRC_POUT14                              (0x4000U)
#define GPIO_PIDRC_PIN15_POS                           (15U)
#define GPIO_PIDRC_PIN15                               (0x8000U)
#define GPIO_PIDRC_POUT15_POS                          (15U)
#define GPIO_PIDRC_POUT15                              (0x8000U)
#define GPIO_PIDRC_PODRC_POS                           (16U)
#define GPIO_PIDRC_PODRC                               (0x1FF0000U)
#define GPIO_PIDRC_PODRC_0                             (0x10000U)
#define GPIO_PIDRC_PODRC_1                             (0x20000U)
#define GPIO_PIDRC_PODRC_2                             (0x40000U)
#define GPIO_PIDRC_PODRC_3                             (0x80000U)
#define GPIO_PIDRC_PODRC_4                             (0x100000U)
#define GPIO_PIDRC_PODRC_5                             (0x200000U)
#define GPIO_PIDRC_PODRC_6                             (0x400000U)
#define GPIO_PIDRC_PODRC_7                             (0x800000U)
#define GPIO_PIDRC_PODRC_8                             (0x1000000U)

/*  Bit definition for GPIO_POERC register  */
#define GPIO_POERC_POUTE13_POS                         (13U)
#define GPIO_POERC_POUTE13                             (0x2000U)
#define GPIO_POERC_POUTE14_POS                         (14U)
#define GPIO_POERC_POUTE14                             (0x4000U)
#define GPIO_POERC_POUTE15_POS                         (15U)
#define GPIO_POERC_POUTE15                             (0x8000U)

