MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F451FEUB/mcu.h
/*  Bit definition for TMR6_BCONR register  */
#define TMR6_BCONR_BENA_POS                            (0U)
#define TMR6_BCONR_BENA                                (0x00000001UL)
#define TMR6_BCONR_BSEA_POS                            (1U)
#define TMR6_BCONR_BSEA                                (0x00000002UL)
#define TMR6_BCONR_BENB_POS                            (2U)
#define TMR6_BCONR_BENB                                (0x00000004UL)
#define TMR6_BCONR_BSEB_POS                            (3U)
#define TMR6_BCONR_BSEB                                (0x00000008UL)
#define TMR6_BCONR_BENP_POS                            (8U)
#define TMR6_BCONR_BENP                                (0x00000100UL)
#define TMR6_BCONR_BSEP_POS                            (9U)
#define TMR6_BCONR_BSEP                                (0x00000200UL)
#define TMR6_BCONR_BENSPA_POS                          (16U)
#define TMR6_BCONR_BENSPA                              (0x00010000UL)
#define TMR6_BCONR_BSESPA_POS                          (17U)
#define TMR6_BCONR_BSESPA                              (0x00020000UL)
#define TMR6_BCONR_BTRUSPA_POS                         (20U)
#define TMR6_BCONR_BTRUSPA                             (0x00100000UL)
#define TMR6_BCONR_BTRDSPA_POS                         (21U)
#define TMR6_BCONR_BTRDSPA                             (0x00200000UL)
#define TMR6_BCONR_BENSPB_POS                          (24U)
#define TMR6_BCONR_BENSPB                              (0x01000000UL)
#define TMR6_BCONR_BSESPB_POS                          (25U)
#define TMR6_BCONR_BSESPB                              (0x02000000UL)
#define TMR6_BCONR_BTRUSPB_POS                         (28U)
#define TMR6_BCONR_BTRUSPB                             (0x10000000UL)
#define TMR6_BCONR_BTRDSPB_POS                         (29U)
#define TMR6_BCONR_BTRDSPB                             (0x20000000UL)

/*  Bit definition for TMR6_DCONR register  */
#define TMR6_DCONR_DTCEN_POS                           (0U)
#define TMR6_DCONR_DTCEN                               (0x00000001UL)
#define TMR6_DCONR_DTBENU_POS                          (4U)
#define TMR6_DCONR_DTBENU                              (0x00000010UL)
#define TMR6_DCONR_DTBEND_POS                          (5U)
#define TMR6_DCONR_DTBEND                              (0x00000020UL)
#define TMR6_DCONR_SEPA_POS                            (8U)
#define TMR6_DCONR_SEPA                                (0x00000100UL)

/*  Bit definition for TMR6_FCONR register  */
#define TMR6_FCONR_NOFIENGA_POS                        (0U)
#define TMR6_FCONR_NOFIENGA                            (0x00000001UL)
#define TMR6_FCONR_NOFICKGA_POS                        (1U)
#define TMR6_FCONR_NOFICKGA                            (0x00000006UL)
#define TMR6_FCONR_NOFICKGA_0                          (0x00000002UL)
#define TMR6_FCONR_NOFICKGA_1                          (0x00000004UL)
#define TMR6_FCONR_NOFIENGB_POS                        (4U)
#define TMR6_FCONR_NOFIENGB                            (0x00000010UL)
#define TMR6_FCONR_NOFICKGB_POS                        (5U)
#define TMR6_FCONR_NOFICKGB                            (0x00000060UL)
#define TMR6_FCONR_NOFICKGB_0                          (0x00000020UL)
#define TMR6_FCONR_NOFICKGB_1                          (0x00000040UL)
#define TMR6_FCONR_NOFIENTA_POS                        (16U)
#define TMR6_FCONR_NOFIENTA                            (0x00010000UL)
#define TMR6_FCONR_NOFICKTA_POS                        (17U)
#define TMR6_FCONR_NOFICKTA                            (0x00060000UL)
#define TMR6_FCONR_NOFICKTA_0                          (0x00020000UL)
#define TMR6_FCONR_NOFICKTA_1                          (0x00040000UL)
#define TMR6_FCONR_NOFIENTB_POS                        (20U)
#define TMR6_FCONR_NOFIENTB                            (0x00100000UL)
#define TMR6_FCONR_NOFICKTB_POS                        (21U)
#define TMR6_FCONR_NOFICKTB                            (0x00600000UL)
#define TMR6_FCONR_NOFICKTB_0                          (0x00200000UL)
#define TMR6_FCONR_NOFICKTB_1                          (0x00400000UL)

/*  Bit definition for TMR6_VPERR register  */
#define TMR6_VPERR_SPPERIA_POS                         (8U)
#define TMR6_VPERR_SPPERIA                             (0x00000100UL)
#define TMR6_VPERR_SPPERIB_POS                         (9U)
#define TMR6_VPERR_SPPERIB                             (0x00000200UL)
#define TMR6_VPERR_PCNTE_POS                           (16U)
#define TMR6_VPERR_PCNTE                               (0x00030000UL)
#define TMR6_VPERR_PCNTE_0                             (0x00010000UL)
#define TMR6_VPERR_PCNTE_1                             (0x00020000UL)
#define TMR6_VPERR_PCNTS_POS                           (18U)
#define TMR6_VPERR_PCNTS                               (0x001C0000UL)

/*  Bit definition for TMR6_STFLR register  */
#define TMR6_STFLR_CMAF_POS                            (0U)
#define TMR6_STFLR_CMAF                                (0x00000001UL)
#define TMR6_STFLR_CMBF_POS                            (1U)
#define TMR6_STFLR_CMBF                                (0x00000002UL)
#define TMR6_STFLR_CMCF_POS                            (2U)
#define TMR6_STFLR_CMCF                                (0x00000004UL)
#define TMR6_STFLR_CMDF_POS                            (3U)
#define TMR6_STFLR_CMDF                                (0x00000008UL)
#define TMR6_STFLR_CMEF_POS                            (4U)
#define TMR6_STFLR_CMEF                                (0x00000010UL)
#define TMR6_STFLR_CMFF_POS                            (5U)
#define TMR6_STFLR_CMFF                                (0x00000020UL)
#define TMR6_STFLR_OVFF_POS                            (6U)
#define TMR6_STFLR_OVFF                                (0x00000040UL)
#define TMR6_STFLR_UDFF_POS                            (7U)
#define TMR6_STFLR_UDFF                                (0x00000080UL)
#define TMR6_STFLR_DTEF_POS                            (8U)
#define TMR6_STFLR_DTEF                                (0x00000100UL)
#define TMR6_STFLR_CMSAUF_POS                          (9U)
#define TMR6_STFLR_CMSAUF                              (0x00000200UL)
#define TMR6_STFLR_CMSADF_POS                          (10U)
#define TMR6_STFLR_CMSADF                              (0x00000400UL)
#define TMR6_STFLR_CMSBUF_POS                          (11U)
#define TMR6_STFLR_CMSBUF                              (0x00000800UL)
#define TMR6_STFLR_CMSBDF_POS                          (12U)
#define TMR6_STFLR_CMSBDF                              (0x00001000UL)
#define TMR6_STFLR_VPERNUM_POS                         (21U)
#define TMR6_STFLR_VPERNUM                             (0x00E00000UL)
#define TMR6_STFLR_DIRF_POS                            (31U)
#define TMR6_STFLR_DIRF                                (0x80000000UL)

